In [2]:
import pandas as pd

In [5]:
data = pd.read_csv(r'C:\Users\omc\Desktop\us-baby-names-release-2015-12-18-00-53-48\output\StateNames.csv')

In [7]:
data.head()

   Id      Name  Year Gender State  Count
0   1      Mary  1910      F    AK     14
1   2     Annie  1910      F    AK     12
2   3      Anna  1910      F    AK     10
3   4  Margaret  1910      F    AK      8
4   5     Helen  1910      F    AK      7

## Problems :
1. Find Total Number of Anna
2. What is the Trend of folks having name Anna
3. Find male vs female birth ratio
4. Male vs Female births over the year

In [36]:
%timeit data_anna = data[data['Name']=='Anna']

1 loop, best of 3: 1.3 s per loop

In [26]:
#sol of 1 : by using Mask
data_anna.count()

Id        5314
Name      5314
Year      5314
Gender    5314
State     5314
Count     5314
dtype: int64

In [25]:
data_anna.shape

(5314, 6)

In [29]:
data_indexed = data.set_index('Name')

In [37]:
#sol 1 : by using loc
%timeit data_anna_1 = data_indexed.loc['Anna']

1 loop, best of 3: 322 ms per loop

In [41]:
data_anna_1.count()

Id        5314
Year      5314
Gender    5314
State     5314
Count     5314
dtype: int64

In [43]:
data_anna_1.head()

       Id  Year Gender State  Count
Name
Anna    3  1910      F    AK     10
Anna   18  1912      F    AK      7
Anna   54  1915      F    AK     10
Anna   76  1916      F    AK      7
Anna  101  1917      F    AK      5

In [46]:
#sol for 2: 
data_anna_year = data_anna_1.groupby('Year')

In [96]:
# data_anna_year.size()

In [52]:
data.head()

   Id      Name  Year Gender State  Count
0   1      Mary  1910      F    AK     14
1   2     Annie  1910      F    AK     12
2   3      Anna  1910      F    AK     10
3   4  Margaret  1910      F    AK      8
4   5     Helen  1910      F    AK      7

In [61]:
# help(data.groupby)
data_male_female = data.groupby('Year')['Gender']

In [65]:
# data_male_female.size()

In [77]:
data_female = data.loc[data['Gender'] == 'F']

In [100]:
# help(data_female.describe)
temp = data_female.groupby('Year')['Gender']
# temp.size()

In [114]:
temp = data.groupby(['Year','Gender'])
temp.size()

Year  Gender
1910  F         10637
      M          6193
1911  F         10868
      M          6753
1912  F         12983
      M         10196
1913  F         13847
      M         11430
1914  F         15489
      M         13333
1915  F         17970
      M         15661
1916  F         18743
      M         15984
1917  F         19000
      M         16379
1918  F         19826
      M         17175
1919  F         19477
      M         17039
1920  F         20133
      M         17545
1921  F         20413
      M         17809
1922  F         20159
      M         17756
1923  F         20204
      M         17498
1924  F         20632
      M         17768
                ...
2000  F         44558
      M         35418
2001  F         45257
      M         35812
2002  F         45596
      M         36373
2003  F         47007
      M         37308
2004  F         48083
      M         38337
2005  F         49196
      M         39298
2006  F         50851
      M         40952
2007  F         52234
      M         42098
2008  F         52568
      M         42402
2009  F         51987
      M         42622
2010  F         51084
      M         42223
2011  F         50651
      M         41894
2012  F         50722
      M         42302
2013  F         50440
      M         42303
2014  F         51030
      M         43118
Length: 210, dtype: int64

In [117]:
data_index_byYear = data.set_index('Year')

In [125]:
data_index_byYear.groupby('Year').size()

Year
1910    16830
1911    17621
1912    23179
1913    25277
1914    28822
1915    33631
1916    34727
1917    35379
1918    37001
1919    36516
1920    37678
1921    38222
1922    37915
1923    37702
1924    38400
1925    37597
1926    37314
1927    37447
1928    36831
1929    35900
1930    35998
1931    34895
1932    35069
1933    34120
1934    34640
1935    34603
1936    34352
1937    34861
1938    35687
1939    35402
        ...
1985    60533
1986    61191
1987    62137
1988    64204
1989    67026
1990    69141
1991    69745
1992    70880
1993    70760
1994    71373
1995    71444
1996    72327
1997    73681
1998    76032
1999    77353
2000    79976
2001    81069
2002    81969
2003    84315
2004    86420
2005    88494
2006    91803
2007    94332
2008    94970
2009    94609
2010    93307
2011    92545
2012    93024
2013    92743
2014    94148
Length: 105, dtype: int64